bookers2-comments/app/views/books/show.html.erb

							<td><%= render "favorites/favorite", book: @book %></td>
							<td><p>コメント数: <%= BookComment.where(book_id: @book.id).count %></p></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]